driver-tests/httpsoapbc/JavaEE_vs_BC/SoapOneWayIn_EJB/src/conf/xml-resources/web-services/EE_SoapOneWayInDoc/wsdl/SoapOneWayInDoc.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions targetNamespace="http://j2ee.netbeans.org/wsdl/SoapOneWayInDoc"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/SoapOneWayInDoc" name="SoapOneWayInDoc" xmlns:ns="http://xml.netbeans.org/schema/ElementSchema" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:file="http://schemas.sun.com/jbi/wsdl-extensions/file/">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/SoapOneWayInDoc">
            <xsd:import namespace="http://xml.netbeans.org/schema/ElementSchema" schemaLocation="ElementSchema.xsd"/>
        </xsd:schema>
    </types>
    <message name="SoapOneWayInDocOperationRequest">
        <part name="part1" element="ns:requestElement"/>
    </message>
    <portType name="SoapOneWayInDocPortType">
        <wsdl:operation name="SoapOneWayInDocOperation">
            <wsdl:input name="input1" message="tns:SoapOneWayInDocOperationRequest"/>
        </wsdl:operation>
    </portType>
    <binding name="SoapOneWayInDocBinding" type="tns:SoapOneWayInDocPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="SoapOneWayInDocOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal"/>
            </wsdl:input>
        </wsdl:operation>
    </binding>
    <service name="SoapOneWayInDocService">
        <wsdl:port name="SoapOneWayInDocPort" binding="tns:SoapOneWayInDocBinding">
            <soap:address location="http://localhost:18181/SoapOneWayInDocService/SoapOneWayInDocPort"/>
        </wsdl:port>
    </service>
    <plnk:partnerLinkType name="SoapOneWayInDocPartner">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="SoapOneWayInDocPortTypeRole" portType="tns:SoapOneWayInDocPortType"/>
    </plnk:partnerLinkType>
</definitions>
