driver-tests/httpsoapbc/JavaEE_vs_BC/SoapReqReplyIn_JBI/test/2ejb_Doc/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:elem="http://xml.netbeans.org/schema/ElementSchema">
  <soapenv:Body>
    <elem:requestElement>
      <elem:request>input data for testcase "2ejb_Doc"</elem:request>
    </elem:requestElement>
  </soapenv:Body>
</soapenv:Envelope>